from collections import OrderedDict

device_list = OrderedDict([
    # 6690，平台
    ("NoteX6", ("6690平台", "国内" , "阅读器" , "10.3" , "黑白")),


    # 662, 平台
    # 国内
    ("Tab10", ("662平台", "国内" , "平板" , "10.3" , "黑白")),
    ("Tab8", ("662平台", "国内" , "平板" , "7.8" , "黑白")),
    ("Tab13", ("662平台", "国内" , "平板" , "13.3" , "黑白")),
    ("Tab8C", ("662平台", "国内" , "平板" , "7.8" , "彩色")),
    ("Tab10C", ("662平台", "国内" , "平板" , "10.3" , "彩色")),
    # 海外
    ("TabUltra", ("662平台", "海外" , "平板" ,"10.3", "黑白")),
    ("TabUltraC", ("662平台", "海外" , "平板" , "10.3" , "彩色")),
    ("TabX", ("662平台", "海外" , "平板" , "13.3" , "黑白")),
    ("TabMiniC", ("662平台", "海外" , "平板" , "7.8" , "彩色")),
    ("Nova5", ("662平台", "国内" , "阅读器" , "7.8" , "黑白")),

    # 6350, 平台
    # 海外
    ("NoteAir5C" , ("6350平台", "海外" , "平板" , "10.3" , "彩色")),
    ("NoteAir4C" , ("6350平台", "海外" , "平板" , "10.3" , "彩色")),
    ("Leaf5C" , ("6350平台", "国内" , "阅读器" , "7" , "彩色")),
    ("Leaf5Plus" , ("6350平台", "国内" , "阅读器" , "7" , "黑白")),
    ("Go7" , ("6350平台", "海外" , "阅读器" , "7" , "黑白")),
    ("GoColor7_2" , ("6350平台", "海外" , "阅读器" , "7" , "彩色")),
    ("Go103_2Lumi" , ("6350平台", "海外" , "阅读器" , "10.3" , "黑白")),

    ("NoteX5Mini" , ("6350平台", "国内" , "阅读器" , "7.8" , "黑白")),

    # 6225, 平台
    # 国内
    ("NoteX5S", ("6350平台", "国内" , "阅读器" , "10.3" , "黑白")),
    ("NoteX5", ("6350平台", "国内" , "阅读器" , "10.3" , "黑白")),
    ("NoteX3", ("6225平台", "国内" , "阅读器" ,"10.3" , "黑白")),
    ("NoteX3S", ("6225平台", "国内" ,"阅读器" ,"10.3" , "黑白")),
    ("T10C", ("6225平台", "国内" ,"平板", "10.3" , "彩色")),
    ("T10CPlus", ("6225平台", "国内" ,"平板", "10.3" , "彩色")),
    ("NoteX3Pro", ("6225平台", "国内" , "阅读器", "10.3" , "黑白")),
    # 海外
    ("Go103", ("6225平台", "海外" ,"阅读器" , "10.3" , "黑白")),
    ("NoteAir3C", ("6225平台", "海外" , "阅读器" , "10.3" , "彩色")),
    ("NoteAir3", ("6225平台", "海外" , "阅读器" , "10.3" , "黑白")),
    ("Go103_2", ("6225平台", "海外" , "阅读器" , "10.3" , "黑白")),

    # 855, 平台
    # 国内
    ("Tab10CPro", ("855平台", "国内" , "平板" , "10.3" , "黑白")),

    # 海外
    ("TabUltraCPro", ("855平台", "海外" , "平板" , "10.3" , "黑白")),
    ("NoteMax", ("855平台", "海外" , "平板" , "13.3" , "黑白")),
    ("T13C", ("855平台", "国内" , "平板" , "13.3" , "彩色")),
    ("TabXC", ("855平台", "海外" , "平板" , "13.3" , "彩色")),

    # 662 平台
    ("NoteX2", ("662平台", "国内" , "阅读器" , "10.3" , "黑白")),
    ("NovaAirC", ("662平台", "国内" , "阅读器" , "7.8" , "彩色"))
])